---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelTreadsNumberFailure
source: html/7b42a2eb-7007-acca-c227-5190d6cbdcff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelTreadsNumberFailure Property

Cannot satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderParallelTreadsNumberFailure { get; }
```